t21/Walnut_X/Packages/.cache/Keil.LPC54000_DFP.2.0.0.pdsc
        <!-- *************************  Device 'LPC54113J128UK49'  ***************************** -->
        <!--device Dname="LPC54113J128UK49">
          <compile header="LPCOpen/lpc5411x/chip_5411x/inc/chip.h" define="CHIP_LPC5411X"/>
          <debug svd="SVD/LPC5411x.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x20020000" size="0x00008000" init   ="0" default="0"/>
          <algorithm Pname="M4" name="Flash/LPC5411x_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <feature type="MPSerial"      n="8"          name="Flexcomm Serial Peripheral Module: USART, SPI, I2C"/>
          <feature type="USBD"          n="1"          name="Full-Speed USB Device"/>
          <feature type="ComOther"      n="1"          name="DMIC Subsystem"/>
          <feature type="ADC"           n="12"       m="12"/>
          <feature type="TempSens"      n="1"/>
          <feature type="Timer"         n="5"        m="32"/>
          <feature type="PWM"           n="1"/>
          <feature type="Temp"          n="-40"      m="105"/>
          <feature type="VCC"           n="1.62"     m="3.60"/>
          <feature type="IOs"           n="37"/>
          <feature type="CSP"           n="49"         name="Wafer-Level Chip-Scale Package"/>
        </device-->

        <!-- *************************  Device 'LPC54113J256BD64'  ***************************** -->
        <device Dname="LPC54113J256BD64">
          <compile header="LPCOpen/lpc5411x/chip_5411x/inc/chip.h" define="CHIP_LPC5411X"/>
          <debug svd="SVD/LPC5411x.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x20020000" size="0x00008000" init   ="0" default="0"/>
          <algorithm Pname="M4" name="Flash/LPC5411x_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book name="Documents/LPC5411X.pdf" title="LPC5411x Datasheet"/>
          <book name="Documents/UM10914.pdf"  title="LPC5411x User manual"/>

          <feature type="MPSerial"      n="8"          name="Flexcomm Serial Peripheral Module: USART, SPI, I2C"/>
          <feature type="USBD"          n="1"          name="Full-Speed USB Device"/>
          <feature type="ComOther"      n="1"          name="DMIC Subsystem"/>
          <feature type="ADC"           n="12"       m="12"/>
          <feature type="TempSens"      n="1"/>
          <feature type="Timer"         n="5"        m="32"/>
          <feature type="PWM"           n="1"/>
          <feature type="Temp"          n="-40"      m="105"/>
          <feature type="VCC"           n="1.62"     m="3.60"/>
          <feature type="IOs"           n="50"/>
          <feature type="QFP"           n="64"         name="Low-Profile QFP Package"/>
        </device>

        <!-- *************************  Device 'LPC54113J256UK49'  ***************************** -->
        <device Dname="LPC54113J256UK49">
          <compile header="LPCOpen/lpc5411x/chip_5411x/inc/chip.h" define="CHIP_LPC5411X"/>
          <debug svd="SVD/LPC5411x.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x20020000" size="0x00008000" init   ="0" default="0"/>
          <algorithm Pname="M4" name="Flash/LPC5411x_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book name="Documents/LPC5411X.pdf" title="LPC5411x Datasheet"/>
          <book name="Documents/UM10914.pdf"  title="LPC5411x User manual"/>

          <feature type="MPSerial"      n="8"          name="Flexcomm Serial Peripheral Module: USART, SPI, I2C"/>
          <feature type="USBD"          n="1"          name="Full-Speed USB Device"/>
          <feature type="ComOther"      n="1"          name="DMIC Subsystem"/>
          <feature type="ADC"           n="12"       m="12"/>
          <feature type="TempSens"      n="1"/>
          <feature type="Timer"         n="5"        m="32"/>
          <feature type="PWM"           n="1"/>
          <feature type="Temp"          n="-40"      m="105"/>
          <feature type="VCC"           n="1.62"     m="3.60"/>
          <feature type="IOs"           n="37"/>
          <feature type="CSP"           n="49"         name="Wafer-Level Chip-Scale Package"/>
        </device>

        <!-- *************************  Device 'LPC54114J256BD64'  ***************************** -->
        <device Dname="LPC54114J256BD64">
          <processor Pname="M0plus" Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="100000000"/>
          <environment Pname="M0plus" name="uv">
            <CMisc>-DCORE_M0PLUS</CMisc>
          </environment>
          <compile header="LPCOpen/lpc5411x/chip_5411x/inc/chip.h" define="CHIP_LPC5411X"/>
          <debug svd="SVD/LPC5411x.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x20020000" size="0x00008000" init   ="0" default="0"/>
          <algorithm Pname="M4" name="Flash/LPC5411x_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book Pname="M0plus" name="Documents/DUI0662B_cortex_m0p_r0p1_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>
          <book name="Documents/LPC5411X.pdf" title="LPC5411x Datasheet"/>
          <book name="Documents/UM10914.pdf"  title="LPC5411x User manual"/>

          <feature type="MPSerial"      n="8"          name="Flexcomm Serial Peripheral Module: USART, SPI, I2C"/>
          <feature type="USBD"          n="1"          name="Full-Speed USB Device"/>
          <feature type="ComOther"      n="1"          name="DMIC Subsystem"/>
          <feature type="ADC"           n="12"       m="12"/>
          <feature type="TempSens"      n="1"/>
          <feature type="Timer"         n="5"        m="32"/>
          <feature type="PWM"           n="1"/>
          <feature type="Temp"          n="-40"      m="105"/>
          <feature type="VCC"           n="1.62"     m="3.60"/>
          <feature type="IOs"           n="50"/>
          <feature type="QFP"           n="64"         name="Low-Profile QFP Package"/>
        </device>

        <!-- *************************  Device 'LPC54114J256UK49'  ***************************** -->
        <device Dname="LPC54114J256UK49">
          <processor Pname="M0plus" Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="100000000"/>
          <environment Pname="M0plus" name="uv">
            <CMisc>-DCORE_M0PLUS</CMisc>
          </environment>
          <compile header="LPCOpen/lpc5411x/chip_5411x/inc/chip.h" define="CHIP_LPC5411X"/>
          <debug svd="SVD/LPC5411x.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x20020000" size="0x00008000" init   ="0" default="0"/>
          <algorithm Pname="M4" name="Flash/LPC5411x_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book Pname="M0plus" name="Documents/DUI0662B_cortex_m0p_r0p1_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>
          <book name="Documents/LPC5411X.pdf" title="LPC5411x Datasheet"/>
          <book name="Documents/UM10914.pdf"  title="LPC5411x User manual"/>

          <feature type="MPSerial"      n="8"          name="Flexcomm Serial Peripheral Module: USART, SPI, I2C"/>
          <feature type="USBD"          n="1"          name="Full-Speed USB Device"/>
          <feature type="ComOther"      n="1"          name="DMIC Subsystem"/>
          <feature type="ADC"           n="12"       m="12"/>
          <feature type="TempSens"      n="1"/>
          <feature type="Timer"         n="5"        m="32"/>
          <feature type="PWM"           n="1"/>
          <feature type="Temp"          n="-40"      m="105"/>
          <feature type="VCC"           n="1.62"     m="3.60"/>
          <feature type="IOs"           n="37"/>
          <feature type="CSP"           n="49"         name="Wafer-Level Chip-Scale Package"/>
        </device>

      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- Device Conditions -->
    <condition id="LPC5410x">
      <description>NXP LPC5410x Devices</description>
      <require Dvendor="NXP:11" Dname="LPC5410*"/>
    </condition>

    <condition id="LPC5411x">
      <description>NXP LPC5411x Devices</description>
      <require Dvendor="NXP:11" Dname="LPC5411*"/>
    </condition>

    <condition id="LPC541xx">
      <description>NXP LPC541xx Devices</description>
      <require Dvendor="NXP:11" Dname="LPC54*"/>
    </condition>

