t21/Walnut_X/Packages/.cache/Keil.LPC54000_DFP.2.0.0.pdsc
    <!-- Device + Core Conditions -->
    <condition id="LPC5410x CM4">
      <description>NXP LPC5410x CM4 Devices</description>
      <require condition="LPC5410x"/>
      <require Dcore="Cortex-M4"/>
    </condition>
    <condition id="LPC5410x CM0+">
      <description>NXP LPC5410x CM0+ Devices</description>
      <require condition="LPC5410x"/>
      <require Dcore="Cortex-M0+"/>
    </condition>

    <condition id="LPC5411x CM4">
      <description>NXP LPC5411x CM4 Devices</description>
      <require condition="LPC5411x"/>
      <require Dcore="Cortex-M4"/>
    </condition>
    <condition id="LPC5411x CM0+">
      <description>NXP LPC5411x CM0+ Devices</description>
      <require condition="LPC5411x"/>
      <require Dcore="Cortex-M0+"/>
    </condition>

    <!-- Device + Core + Compiler Conditions -->
    <condition id="LPC5410x CM4 ARMCC">
      <description>NXP LPC5410x CM4 Devices and the ARM compiler</description>
      <require condition="LPC5410x CM4"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="LPC5410x CM0+ ARMCC">
      <description>NXP LPC5410x CM0+ Devices and the ARM compiler</description>
      <require condition="LPC5410x CM0+"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="LPC5410x CM4 IAR">
      <description>NXP LPC5410x CM4 Devices and the IAR compiler</description>
      <require condition="LPC5410x CM4"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="LPC5410x CM0+ IAR">
      <description>NXP LPC5410x CM0+ Devices and the IAR compiler</description>
      <require condition="LPC5410x CM0+"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="LPC5411x CM4 ARMCC">
      <description>NXP LPC5411x CM4 Devices and the ARM compiler</description>
      <require condition="LPC5411x CM4"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="LPC5411x CM0+ ARMCC">
      <description>NXP LPC5411x CM0+ Devices and the ARM compiler</description>
      <require condition="LPC5411x CM0+"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="LPC5411x CM4 IAR">
      <description>NXP LPC5411x CM4 Devices and the IAR compiler</description>
      <require condition="LPC5411x CM4"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="LPC5411x CM0+ IAR">
      <description>NXP LPC5411x CM0+ Devices and the IAR compiler</description>
      <require condition="LPC5411x CM0+"/>
      <require Tcompiler="IAR"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="LPC541xx CMSIS">
      <description>NXP LPC541xx Devices and CMSIS-CORE</description>
      <require condition="LPC541xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="LPC5410x CMSIS">
      <description>NXP LPC5410x Devices and CMSIS-CORE</description>
      <require condition="LPC5410x"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="LPC5411x CMSIS">
      <description>NXP LPC5411x Devices and CMSIS-CORE</description>
      <require condition="LPC5411x"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- Device + CMSIS + LPCOpen Conditions -->
    <condition id="LPC541xx CMSIS LPCOPEN">
      <description>NXP LPC541xx Devices and LPCOpen firmware</description>
      <require condition="LPC541xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="LPCOpen"/>
    </condition>

    <condition id="LPC541xx CMSIS LPCOPEN_BSP">
      <description>NXP LPC541xx Devices and LPCOpen board support firmware</description>
      <require condition="LPC541xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="LPCOpen"/>
      <deny Cclass="Compiler" Cgroup="I/O"/>
    </condition>

    <!-- CMSIS Driver Conditions -->
    <condition id="LPC541xx CMSIS_Driver I2C">
      <description>Requirement for CMSIS I2C Driver</description>
      <require condition="LPC541xx CMSIS LPCOPEN"/>
    </condition>

    <condition id="LPC541xx CMSIS_Driver SPI">
      <description>Requirement for CMSIS SPI Driver</description>
      <require condition="LPC541xx CMSIS LPCOPEN"/>
    </condition>

    <condition id="LPC541xx CMSIS_Driver SAI">
      <description>Requirement for CMSIS SAI Driver</description>
      <require condition="LPC5411x CMSIS"/>
      <require Cclass="Device" Cgroup="LPCOpen"/>
    </condition>

    <condition id="LPC541xx CMSIS_Driver USART">
      <description>Requirement for CMSIS USART Driver</description>
      <require condition="LPC541xx CMSIS LPCOPEN"/>
    </condition>

    <condition id="LPC541xx CMSIS_Driver USB">
      <description>Requirement for CMSIS USB Driver</description>
      <require condition="LPC5411x CMSIS"/>
      <require Cclass="Device" Cgroup="LPCOpen"/>
    </condition>

    <!-- Device + CMSIS Driver -->
    <condition id="LPC541xx I2C">
      <description>Requirement for components using CMSIS I2C driver</description>
      <require condition="LPC541xx"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C"/>
    </condition>

    <condition id="LPC541xx SPI">
      <description>Requirement for components using CMSIS SPI driver</description>
      <require condition="LPC541xx"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI"/>
    </condition>
  </conditions>

  <components>
    <!-- Startup LPC54100 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="3.1.0" condition="LPC541xx CMSIS LPCOPEN">
      <description>System Startup for NXP LPC54100 Devices</description>
      <files>
        <file category="header"    name="RTE_Driver/Config_LPC5410x/RTE_Device.h"                        attr="config" version="1.0.0" condition="LPC5410x"/>
        <file category="header"    name="RTE_Driver/Config_LPC5411x/RTE_Device.h"                        attr="config" version="1.0.0" condition="LPC5411x"/>

        <file category="sourceC"   name="LPCOpen/lpc5410x/chip_5410x/startup/sysinit.c"                  attr="config" version="1.0.0"/>

        <file category="sourceAsm" name="LPCOpen/lpc5410x/chip_5410x/startup/keil_startup_lpc5410x.s"    attr="config" version="1.0.0" condition="LPC5410x CM4 ARMCC"/>
        <file category="sourceAsm" name="LPCOpen/lpc5410x/chip_5410x/startup/keil_startup_lpc5410x-m0.s" attr="config" version="1.0.0" condition="LPC5410x CM0+ ARMCC"/>

        <file category="sourceAsm" name="LPCOpen/lpc5411x/chip_5411x/startup/keil_startup_lpc5411x.s"    attr="config" version="1.0.0" condition="LPC5411x CM4 ARMCC"/>
        <file category="sourceAsm" name="LPCOpen/lpc5411x/chip_5411x/startup/keil_startup_lpc5411x-m0.s" attr="config" version="1.0.0" condition="LPC5411x CM0+ ARMCC"/>

        <file category="sourceAsm" name="LPCOpen/lpc5410x/chip_5410x/startup/iar_startup_lpc5410x.s"     attr="config" version="1.0.0" condition="LPC5410x CM4 IAR"/>
        <file category="sourceAsm" name="LPCOpen/lpc5410x/chip_5410x/startup/iar_startup_lpc5410x-m0.s"  attr="config" version="1.0.0" condition="LPC5410x CM0+ IAR"/>

        <file category="sourceAsm" name="LPCOpen/lpc5411x/chip_5411x/startup/iar_startup_lpc5411x.s"     attr="config" version="1.0.0" condition="LPC5411x CM4 IAR"/>
        <file category="sourceAsm" name="LPCOpen/lpc5411x/chip_5411x/startup/iar_startup_lpc5411x-m0.s"  attr="config" version="1.0.0" condition="LPC5411x CM0+ IAR"/>
      </files>
    </component>

