t21/Walnut_X/Packages/.cache/Keil.LPC54000_DFP.2.0.0.pdsc
    <component Cclass="Device" Cgroup="LPCOpen" Cversion="3.01.000" condition="LPC5410x CMSIS">
      <description>LPCOpen chip drivers for the NXP LPC54100 family</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LPCOPEN
      </RTE_Components_h>
      <files>
        <file category="library" condition="LPC5410x CM4 ARMCC"  name="LPCOpen/lpc5410x/chip_5410x/libs/keil_lib_power.lib"/>
        <file category="library" condition="LPC5410x CM4 ARMCC"  name="LPCOpen/lpc5410x/prj_lpcxpresso_54102/keil/lib_chip_5410x/keil_output/core_m4/lib_chip_5410x.lib" src="LPCOpen/lpc5410x/chip_5410x/src/"/>
        <file category="library" condition="LPC5410x CM0+ ARMCC" name="LPCOpen/lpc5410x/chip_5410x/libs/keil_lib_power_m0.lib"/>
        <file category="library" condition="LPC5410x CM0+ ARMCC" name="LPCOpen/lpc5410x/prj_lpcxpresso_54102/keil/lib_chip_5410x_m0/keil_output/core_m0/lib_chip_5410x_m0.lib" src="LPCOpen/lpc5410x/chip_5410x/src/"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="LPCOpen" Cversion="3.00c.001" condition="LPC5411x CMSIS">
      <description>LPCOpen chip drivers for the NXP LPC54110 family</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LPCOPEN
      </RTE_Components_h>
      <files>
        <file category="library" condition="LPC5411x CM4 ARMCC"  name="LPCOpen/lpc5411x/chip_5411x/libs/keil_lib_power.lib"/>
        <file category="library" condition="LPC5411x CM4 ARMCC"  name="LPCOpen/lpc5411x/prj_xpresso54114/keil/lib_chip_5411x/keil_output/core_m4/lib_chip_5411x.lib" src="LPCOpen/lpc5411x/chip_5411x/src/"/>
        <file category="library" condition="LPC5411x CM0+ ARMCC" name="LPCOpen/lpc5411x/chip_5411x/libs/keil_lib_power_m0.lib"/>
        <file category="library" condition="LPC5411x CM0+ ARMCC" name="LPCOpen/lpc5411x/prj_xpresso54114/keil/lib_chip_5411x_m0/keil_output/core_m0/lib_chip_5411x_m0.lib" src="LPCOpen/lpc5411x/chip_5411x/src/"/>
      </files>
    </component>

    <!-- CMSIS Driver class -->
    <component Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.2" Cversion="1.0" condition="LPC541xx CMSIS_Driver I2C">
      <description>I2C Driver for LPC54100 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_I2C0                /* Driver I2C0 */
        #define RTE_Drivers_I2C1                /* Driver I2C1 */
        #define RTE_Drivers_I2C2                /* Driver I2C2 */
        #define RTE_Drivers_I2C3                /* Driver I2C3 */
        #define RTE_Drivers_I2C4                /* Driver I2C4 */
        #define RTE_Drivers_I2C5                /* Driver I2C5 */
        #define RTE_Drivers_I2C6                /* Driver I2C6 */
        #define RTE_Drivers_I2C7                /* Driver I2C7 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/I2C_LPC5410x.c" condition="LPC5410x"/>
        <file category="source" name="RTE_Driver/I2C_LPC5411x.c" condition="LPC5411x"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="SAI" Capiversion="1.0" Cversion="1.0" condition="LPC541xx CMSIS_Driver SAI">
      <description>SAI Driver for LPC54100 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_SAI0                /* Driver SAI0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/I2S_LPC5411x.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="SPI" Capiversion="2.1" Cversion="1.0" condition="LPC541xx CMSIS_Driver SPI">
      <description>SPI Driver for LPC54100 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_SPI0                /* Driver SPI0 */
        #define RTE_Drivers_SPI1                /* Driver SPI1 */
        #define RTE_Drivers_SPI2                /* Driver SPI2 */
        #define RTE_Drivers_SPI3                /* Driver SPI3 */
        #define RTE_Drivers_SPI4                /* Driver SPI4 */
        #define RTE_Drivers_SPI5                /* Driver SPI5 */
        #define RTE_Drivers_SPI6                /* Driver SPI6 */
        #define RTE_Drivers_SPI7                /* Driver SPI7 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/SPI_LPC5410x.c" condition="LPC5410x"/>
        <file category="source" name="RTE_Driver/SPI_LPC5411x.c" condition="LPC5411x"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.1" Cversion="1.0" condition="LPC541xx CMSIS_Driver USART">
      <description>USART Driver for LPC54100 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_USART0              /* Driver USART0 */
        #define RTE_Drivers_USART1              /* Driver USART1 */
        #define RTE_Drivers_USART2              /* Driver USART2 */
        #define RTE_Drivers_USART3              /* Driver USART3 */
        #define RTE_Drivers_USART4              /* Driver USART4 */
        #define RTE_Drivers_USART5              /* Driver USART5 */
        #define RTE_Drivers_USART6              /* Driver USART6 */
        #define RTE_Drivers_USART7              /* Driver USART7 */
        </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/USART_LPC5410x.c"  condition="LPC5410x"/>
        <file category="source" name="RTE_Driver/USART_LPC5411x.c"  condition="LPC5411x"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USB Device" Capiversion="2.1" Cversion="1.0" condition="LPC541xx CMSIS_Driver USB">
      <description>USB Device Driver for LPC54100 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/USBD_LPC5411x.c"/>
      </files>
    </component>

    <!-- MCB54110 Board Support-->
    <bundle Cbundle="MCB54110" Cclass="Board Support" Cversion="1.0.0">
      <description>Keil Development Board MCB54110</description>
      <!-- <doc>Documents/mcb54110.chm</doc> -->
      <component Cgroup="A/D Converter" Capiversion="1.0.0" condition="LPC541xx CMSIS LPCOPEN">
        <description>A/D Converter interface for Keil MCB54110 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB54110/Common/ADC_MCB54110.c"/>
        </files>
      </component>
