t21/Walnut_X/Packages/.cache/Keil.LPC54000_DFP.2.0.0.pdsc
      <component Cgroup="LED" Capiversion="1.0.0" condition="LPC541xx I2C">
        <description>LED interface for Keil MCB54110 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB54110/Common/LED_MCB54110.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="LPC541xx CMSIS LPCOPEN">
        <description>Buttons interface for Keil MCB54110 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB54110/Common/Buttons_MCB54110.c"/>
        </files>
      </component>
      <component Cgroup="Joystick" Capiversion="1.0.0" condition="LPC541xx I2C">
        <description>Joystick interface for Keil MCB54110 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB54110/Common/Joystick_MCB54110.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.0.0" condition="LPC541xx SPI">
        <description>Graphic LCD interface for Keil MCB54110 Development Board</description>
        <files>
          <file category="header" name="Boards/Keil/MCB54110/Common/GLCD_Config.h"/>
          <file category="source" name="Boards/Keil/MCB54110/Common/GLCD_Fonts.c"/>
          <file category="source" name="Boards/Keil/MCB54110/Common/GLCD_MCB54110.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Capiversion="1.1.0" Cvariant="SPI IF" condition="LPC541xx SPI">
        <description>emWin LCD RGB Interface for Keil MCB54110 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB54110/Common/LCD_X.c"/>
        </files>
      </component>
      <component Cgroup="Touchscreen" Capiversion="1.0.0" Csub="STMPE811" condition="LPC541xx I2C">
        <description>Touchscreen interface for STMPE811</description>
        <files>
          <file category="header" name="Boards/Keil/MCB54110/Common/STMPE811.h"/>
          <file category="source" name="Boards/Keil/MCB54110/Common/Touch_STMPE811.c"/>
        </files>
      </component>
      <component Cgroup="Thermometer" Capiversion="1.0.0" Csub="LM75" condition="LPC541xx I2C">
        <description>Thermometer interface for LM75</description>
        <files>
          <file category="source" name="Boards/Keil/MCB54110/Common/Thermometer_LM75.c"/>
        </files>
      </component>
    </bundle>

    <!-- LPCXpresso54102 Board Support-->
    <bundle Cbundle="LPCXpresso54102" Cclass="Board Support" Cversion="1.0.0">
      <description>NXP LPCXpresso54102 Board</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.00" condition="LPC5410x CMSIS">
        <description>LED driver for NXP LPCXpresso54102 Board</description>
        <files>
          <file category="source" name="Boards/NXP/LPCXpresso54102/Common/LED_LPCXpresso54102.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="LPC5410x CMSIS">
        <description>Buttons interface for NXP LPCXpresso54102 Board</description>
        <files>
          <file category="source" name="Boards/NXP/LPCXpresso54102/Common/Buttons_LPCXpresso54102.c"/>
        </files>
      </component>
      <component Cgroup="LPCOpen" Cversion="3.01.000" condition="LPC541xx CMSIS LPCOPEN_BSP">
      <description>LPCOpen board support code for LPCXpresso54102 board</description>
        <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
          #define RTE_BOARD_SUPPORT_LPCOPEN
        </RTE_Components_h>
        <files>
          <file category="include" condition="LPC5410x"            name="LPCOpen/lpc5410x/lpcxpresso_54102/inc/"/>
          <file category="header"  condition="LPC5410x"            name="LPCOpen/lpc5410x/lpcxpresso_54102/inc/board.h"/>
          <file category="library" condition="LPC5410x CM4 ARMCC"  name="LPCOpen/lpc5410x/prj_lpcxpresso_54102/keil/lib_board_lpcxpresso_54102/keil_output/core_m4/lib_board_lpcxpresso_lpc54102.lib" src="LPCOpen/lpc5410x/lpcxpresso_54102/src/"/>
          <file category="library" condition="LPC5410x CM0+ ARMCC" name="LPCOpen/lpc5410x/prj_lpcxpresso_54102/keil/lib_board_lpcxpresso_54102_m0/keil_output/core_m0/lib_board_lpcxpresso_54102_m0.lib" src="LPCOpen/lpc5410x/lpcxpresso_54102/src/"/>
        </files>
      </component>
    </bundle>

    <!-- LPCXpresso5411x Board Support-->
    <bundle Cbundle="LPCXpresso54114" Cclass="Board Support" Cversion="1.0.0">
      <description>NXP LPCXpresso54114 Board</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.00" condition="LPC5411x CMSIS">
        <description>LED driver for NXP LPCXpresso54114 Board</description>
        <files>
          <file category="source" name="Boards/NXP/LPCXpresso54114/Common/LED_LPCXpresso54114.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="LPC5411x CMSIS">
        <description>Buttons interface for NXP LPCXpresso54114 Board</description>
        <files>
          <file category="source" name="Boards/NXP/LPCXpresso54114/Common/Buttons_LPCXpresso54114.c"/>
        </files>
      </component>
      <component Cgroup="LPCOpen" Cversion="3.00c.001" condition="LPC541xx CMSIS LPCOPEN_BSP">
      <description>LPCOpen board support code for LPCXpresso54114 board</description>
        <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
          #define RTE_BOARD_SUPPORT_LPCOPEN
        </RTE_Components_h>
        <files>
          <file category="include" condition="LPC5411x"            name="LPCOpen/lpc5411x/brd_xpresso54114/inc/"/>
          <file category="header"  condition="LPC5411x"            name="LPCOpen/lpc5411x/brd_xpresso54114/inc/board.h"/>
          <file category="library" condition="LPC5411x CM4 ARMCC"  name="LPCOpen/lpc5411x/prj_xpresso54114/keil/lib_board_lpcxpresso_54114/keil_output/core_m4/lib_board_lpcxpresso_54114.lib" src="LPCOpen/lpc5411x/lpcxpresso_54114/src/"/>
          <file category="library" condition="LPC5411x CM0+ ARMCC" name="LPCOpen/lpc5411x/prj_xpresso54114/keil/lib_board_lpcxpresso_54114_m0/keil_output/core_m0/lib_board_lpcxpresso_54114_m0.lib" src="LPCOpen/lpc5411x/lpcxpresso_54114/src/"/>
        </files>
      </component>
    </bundle>

  </components>

