t21/Walnut_X/Packages/.cache/Keil.LPC54000_DFP.2.0.0.pdsc
  <boards>
    <board vendor="Keil" name="MCB54110" revision="Ver 1.0" salesContact="sales.intl@keil.com" orderForm="http://www.keil.com/product/prices.asp?MCB54110=ON">
      <description>Keil MCB54110 Development Board</description>
      <!--
      <image small="Boards/Keil/MCB54110/Documents/mcb54110_small.png"
             large="Boards/Keil/MCB54110/Documents/mcb54110_large.png"/>
      <book category="overview"  name="http://www.keil.com/mcb54110/" title="MCB54110 Evaluation Board Web Page"/>
      <book category="schematic" name="Documents/mcb54110v1-0-schematics.pdf" title="MCB54110 Schematics"/>
      <book category="manual"    name="Documents/mcb54110.chm" title="User Manual"/>
      -->
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="LPC54114J256BD64"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="LPC54110"/>
      <feature type="PWR"             n="1"              name="USB Powered"/>
      <feature type="ROM"             n="1"              name="8 MB SPI Flash"/>
      <feature type="MemCard"         n="1"              name="microSD Card Holder"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full-speed Device interface (micro USB Device connectors)"/>
      <feature type="RS232"           n="1"/>
      <feature type="GLCD"            n="1"  m="240.320" name="2.4 inch Color QVGA TFT LCD with resistive touchscreen"/>
      <feature type="Poti"            n="1"              name="Potentiometer for ADC Input"/>
      <feature type="LineIn"          n="1"              name="Audio CODEC with Line-In/Out and Speaker/Microphone"/>
      <feature type="LineOut"         n="1"              name="Audio CODEC with Line-In/Out and Speaker/Microphone"/>
      <feature type="ConnOther"       n="1"              name="On-board Speaker"/>
      <feature type="Button"          n="4"              name="Push-Buttons: Reset, ISP0, ISP1, WAKEUP"/>
      <feature type="LED"             n="8"              name="I/O Port LEDs"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
    </board>
  
    <board vendor="NXP" name="LPCXpresso54102" revision="Rev. A" salesContact="http://www.nxp.com/support.html">
      <description>NXP LPCXpresso54102 Board</description>
      <image small="Boards/NXP/LPCXpresso54102/Documents/LPCXpresso54102_small.png"
             large="Boards/NXP/LPCXpresso54102/Documents/LPCXpresso54102_large.png"/>
      <book category="overview"  name="http://www.nxp.com/demoboard/OM13077.html"                         title="LPCXpresso Board for the LPC54100 family of MCUs"/>
      <book category="schematic" name="Boards/NXP/LPCXpresso54102/Documents/LPCX54102_Schematic_RevA.pdf" title="LPCXpresso54102 Schematics"/>
      <book category="manual"    name="Boards/NXP/LPCXpresso54102/Documents/UM10855-om13077.pdf"          title="LPCXpresso54102 User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="LPC54102J512BD64"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="LPC54100"/>
      <feature type="XTAL"            n="1200000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="LED"             n="3"              name="I/O Port RGB LED"/>
      <feature type="Button"          n="3"              name="Reset, Wake, ISP button"/>
      <feature type="ArduinoFF"       n="1"/>
      <feature type="ConnOther"       n="1"              name="FTDI compatible interface"/>
      <feature type="ConnOther"       n="1"              name="PMOD compatible interface"/>
      <feature type="ODbg"            n="1"              name="LPC-Link2"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
    </board>

    <board vendor="NXP" name="LPCXpresso54114" revision="Rev. A" salesContact="http://www.nxp.com/support.html">
      <description>NXP LPCXpresso54114 Board</description>
<!--
      <image small="Boards/NXP/LPCXpresso54114/Documents/LPCXpresso54114_small.png"
             large="Boards/NXP/LPCXpresso54114/Documents/LPCXpresso54114_large.png"/>
      <book category="overview"  name="http://www.nxp.com/demoboard/OM13077.html"                         title="LPCXpresso Board for the LPC54100 family of MCUs"/>
      <book category="schematic" name="Boards/NXP/LPCXpresso54114/Documents/LPCX54114_Schematic_RevA.pdf" title="LPCXpresso54114 Schematics"/>
      <book category="manual"    name="Boards/NXP/LPCXpresso54114/Documents/UM10855-om13077.pdf"          title="LPCXpresso54114 User Manual"/>
-->
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="LPC54114J256BD64"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="LPC54100"/>
      <feature type="XTAL"            n="1200000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="LED"             n="3"              name="I/O Port RGB LED"/>
      <feature type="Button"          n="3"              name="Reset, Wake, ISP button"/>
      <feature type="ArduinoFF"       n="1"/>
      <feature type="ConnOther"       n="1"              name="FTDI compatible interface"/>
      <feature type="ConnOther"       n="1"              name="PMOD compatible interface"/>
      <feature type="ODbg"            n="1"              name="LPC-Link2"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
    </board>
  </boards>

  <examples>
    <!-- MCB54110 Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/Keil/MCB54110/Blinky" version="1.0.0">
      <description>CMSIS-RTOS Blinky example</description>
      <board name="MCB54110" vendor="Keil"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="DualCore Blinky" doc="Abstract.txt" folder="Boards/Keil/MCB54110/DualCore" version="1.0.0">
      <description>DualCore Blinky example</description>
      <board name="MCB54110" vendor="Keil"/>
      <project>
        <environment name="uv" load="DualCore.uvmpw"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

